[{
        "ID": "1037B",
        "Course": "VIDEO PRODUCTION: DIGITAL FILMMAKING I",
        "Description": "In this Blended Learning* course, students will investigate techniques of video production: directorial style, script development, camera technique, editing, etc. Evaluation of the aesthetic principles of videography, investigation of selected historical topics, and 'hands - on' training in video technique will form the basis of most class sessions. Students will write, shoot, and edit short films ranging from the traditional to the avant-garde. In order to produce original digital films, students will be trained in camera technique and in the uses of non-linear editing and audio creation software applications.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "VPA"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1038B",
        "Course": "ADVANCED VIDEO PRODUCTION: DIGITAL FILMMAKING II",
        "Description": "Advanced Video Production Digital Filmmaking II is a Blended Learning* course which provides students with opportunities to work on individual and small group video projects at the mastery level with industry grade equipment and software. Peer mentorship and brief workshop methods will be employed to provide students with understandings of advanced principles and practices of digital filmmaking. Students in this course will be expected to use time outside of the school day in collaborative groups during the production process and are expected to complete post production within our specialty lab via Adobe Premiere, After Effects and Audition. This course can be used to fulfill the Career-Technical Education graduation requirements or the 'f' requirement, the Visual and Performing Arts requirement, for the CSU and UC systems with honors credit. May be repeated for credit with permission of instructor.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "R",
        "Prerequisites": ["Video Production: Digital Filmmaking I", "Broadcast Journalism", "or Multimedia Journalism"],
        "Category": ["CTE", "VPA"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1044B",
        "Course": "ADVANCED VIDEO PRODUCTION: DIGITAL FILMMAKING HONORS",
        "Description": "The honors option for Advanced Video Production Digital Filmmaking II is an advanced Blended Learning* course providing students with opportunities to work on individual and small group video projects at the mastery level with industry grade equipment and software. Peer mentorship and brief workshop methods will be employed to provide students with understandings of advanced principles and practices of digital filmmaking. Students in this course will be expected to use time outside of the school day in collaborative groups during the production process and are expected to complete post production within our specialty lab via Adobe Premiere, After Effects and Audition. The honors option includes additional written, production presentation and exhibition work that may include, but is not limited to, genre analysis essay, script revision and portfolio, production journals, film analysis journals, a capstone end of class portfolio reflection and presentation. This course can be used to fulfill the Career-Technical Education graduation requirements or the 'f' requirement, the Visual and Performing Arts requirement, for the CSU and UC systems with honors credit. May be repeated for credit with permission of instructor.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "H",
        "Prerequisites": ["Video Production: Digital Filmmaking I", "Broadcast Journalism", "or Multimedia Journalism"],
        "Category": ["CTE", "VPA"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1054B",
        "Course": "AUDIO MUSIC PRODUCTION I",
        "Description": "The Audio Music Production Blended Learning* course focuses on the aesthetic qualities of sound production and analyzes the impact of digital audio technology as an inherent form of communication in today's society, including production, recording, composing and editing. Students will convey creative expression and develop ideas individually and within groups, write compositions, proposals, and budgets. Projects will consist of historical and or cultural nature, and completed projects will be an audio product based on compositions. Students will also write and produce podcasts and songs in a variety of formats. Students will study the impact audio and sound production has on our society from a social, economic, and political viewpoint. Students will learn the history of sound production and the technological advances in the art form. The class will gain knowledge and utilization of microphones, both digital, and analog and computer-based audio editing and recording equipment, and software programs such as Logic Pro, Pro Tools, Ableton Live, and Adobe Audition. Study and training in the Audio Music Production course will prepare students for careers in music engineering and production, post-production for film and television, and live sound mixing for theater and concerts. Students will develop an extensive Digital Audio Portfolio - A collection of sound designs, podcasts, and produced music.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1055B",
        "Course": "ADVANCED AUDIO MUSIC PRODUCTION",
        "Description": "This CTE Audio Production capstone course is a Blended Learning* course that builds on the skill sets of the Audio Production 1 course and further prepares students for a wide variety of careers in professional audio industries. In addition to strengthening the skills learned in Audio Production I, students will learn advanced live recording, advanced mixing, synthesis, 'off - site' recording and mixing, and live sound reinforcement, music composition and songwriting. Students will create and perform their own live electronic performance piece and explore their personal interests (digital music production, film scoring, sound design), while being challenged with real-world concepts and technologies found in today's professional audio industries. Each unit focuses on a major project, building off the skills learned in Audio Production 1 and in previous projects. The class will gain knowledge and utilization of microphones, both digital, and analog and computer-based audio editing and recording equipment, and software programs such as Logic Pro, Ableton Live, and Adobe Audition. Students will also create a digital personal portfolio of their work for final presentation. Study and training in the Audio Production course will prepare students for careers in music engineering and production, post-production for film and television, and live sound-mixing for theater and concerts. Students will develop an extensive Digital Audio Portfolio (a collection of sound designs, podcasts, and produced songs).",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1494B",
        "Course": "BROADCAST JOURNALISM",
        "Description": "This Blended Learning* course is an intensive laboratory course in gathering, writing and producing news for broadcast media for GunnTV on the Titan Broadcast Network (TBN). Workshop methods and 'hands - on' training will be employed to provide students with an understanding of the principles of broadcast television production, video journalism, and radio. Operation of broadcast newsrooms, ethics in broadcast journalism, interviewing techniques, and media criticism will also be examined in the course. This course also serves to broadcast campus news and selected features to the Gunn High School community. Students will be required to attend a weekly lab session in the broadcast studio during the 0 period (7:30 a.m. - 8:30 a.m.) to produce a live television announcements show. Lab sessions will be scheduled weekly. Broadcasting operates as a project-based classroom where collaborative groups will be responsible for creating student produced school video features. All student productions will be broadcast over television and the web. Field video production will be applied to explore various types of programs such as student documentaries, sports and events. Speaking and interpersonal abilities are integral to this class for interviews and appearances on camera. This blended course will address the hands-on use of technology, primarily cameras, video editing software, podcasts, and web streaming.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 2,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "7625",
        "Course": "BEGINNING JOURNALISM",
        "Description": "Through reading and analyzing professional models of non-fiction writing including news, features, editorials and reviews, students will learn to plan, write and revise news stories, profiles, personal experience, observational and persuasive writing. Students will acquire the skills of fact gathering and note-taking through interviews with primary sources and research of secondary sources. This elective course is a prerequisite for both Advanced Journalism and Media Leadership and Management GraphPub (H). See the Media Arts Pathway on page 13.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "8674B",
        "Course": "ADVANCED JOURNALISM (ORACLE)",
        "Description": "Advanced Journalism and Media Studies (AJAMS) builds upon the foundational understandings of journalistic writing and ethics that were explored in the Beginning Journalism course. Working under the guidance of students in Media Leadership and Management (and under the supervision of the teacher/adviser), AJAMS students will employ various genres of journalistic writing to investigate topics of importance within their local community, and will work together to develop and circulate a regularly recurring journalistic publication or other media production to their school community, publishing in print, digital, audio, broadcast/streaming, and/or social media. Students will progress in their ability to defend – both orally and in writing – decisions regarding the medium and style of their journalistic output, and its legal and ethical soundness. Students will analyze the writing styles and perspectives of prominent local media while also frequently reflecting on the styles, perspectives, and values represented in their own publication. This course may be repeated for credit, but students entering their senior year will enroll in Media Leadership and Management or Media Leadership and Management Honors.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0.5,
        "Level": "A",
        "Prerequisites": ["Beginning Journalism"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8654",
        "Course": "MEDIA LEADERSHIP & MANAGEMENT GRAPHIC PRODUCTION",
        "Description": "This course is a capstone option in an extensive media and digital communication strand offered at the school. Students will have successfully completed prerequisites that cover journalism reporting and writing, design, photography and production. This leads to a year of serving in a publication leadership role in peer-editing and production teams for student media as well as studying college and career options. Options will range from serving as a section editor to managing editor to business manager, or as an editor-in-chief over a full staff. In addition to peer editing responsibilities, leadership and management, students will work to create a sense of community, foster the development of good journalistic principles, help each other and their younger peers in the selection of story ideas, conduct primary research, and will serve as writing coaches. The honors class differs from its parallel in Media Leadership and Management in that students will complete more extensive personal explorations, reflections and analytical work in leadership and management. In key assignments, they will interact with professional media leaders. They will demonstrate mastery of all journalistic reporting and writing principles as well as print, digital and mobile package planning and execution.",
        "Grade": [0, 0, 0, 12],
        "HomeworkTime": 0.5,
        "Level": "R",
        "Prerequisites": ["Beginning Journalism", "Advanced Journalism"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8655",
        "Course": "MEDIA LEADERSHIP & MANAGEMENT GRAPHIC PRODUCTION H",
        "Description": "This course is a capstone option in an extensive media and digital communication strand offered at the school. Students will have successfully completed pre-requisites that cover journalism reporting and writing, design, photography and production. This leads to a year of serving in a publication leadership role in peer-editing and production teams for student media as well as studying college and career options. Options will range from serving as a section editor to managing editor to business manager, or as an editor-in-chief over a full staff. In addition to peer editing responsibilities, leadership and management, students will work to create a sense of community, foster the development of good journalistic principles, help each other and their younger peers in the selection of story ideas, conduct primary research, and will serve as writing coaches. The honors class differs from its parallel in Media Leadership and Management in that students will complete more extensive personal explorations, reflections and analytical work in leadership and management. In key assignments, they will interact with professional media leaders. They will demonstrate mastery of all journalistic reporting and writing principles as well as print, digital and mobile package planning and execution.",
        "Grade": [0, 0, 0, 12],
        "HomeworkTime": 0.5,
        "Level": "H",
        "Prerequisites": ["Beginning Journalism", "Advanced Journalism"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1087",
        "Course": "STAGE TECHNOLOGY",
        "Description": "Stage Technology and Design is designed to integrate theoretical and practical knowledge of stage technology and design. Students will study the design and construction of sets, lighting, sound, and costumes, and apply their skills by developing design concepts and mounting productions from a variety of theatrical genres. By assuming vital roles in play productions, students will work effectively in leadership and ensemble situations, and experience the relationship of technical theatre to the theatrical event as a whole. Students will learn to operate theatrical equipment and tools safely, and use these skills to provide technical services for many school stage activities. This course satisfies the Career Technical Education Program requirement and Visual and Performing Arts requirement, and may be repeated for four years. Students who enroll in and complete Stage Technology will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": "0",
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1088",
        "Course": "STAGE TECHNOLOGY",
        "Description": "Stage Technology and Design is designed to integrate theoretical and practical knowledge of stage technology and design. Students will study the design and construction of sets, lighting, sound, and costumes, and apply their skills by developing design concepts and mounting productions from a variety of theatrical genres. By assuming vital roles in play productions, students will work effectively in leadership and ensemble situations, and experience the relationship of technical theatre to the theatrical event as a whole. Students will learn to operate theatrical equipment and tools safely, and use these skills to provide technical services for many school stage activities. This course satisfies the Career Technical Education Program requirement and Visual and Performing Arts requirement, and may be repeated for four years. Students who enroll in and complete Stage Technology will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "4915",
        "Course": "ADVANCED STAGE TECHNOLOGY & DESIGN",
        "Description": "Students will continue to practice their technical theater skills at an advanced level through working in leadership roles on Gunn Theatre Productions. They will manage and supervise a design or construction crew while drawing on their knowledge of theater history, design aesthetics, and creative processes. At the end of a production, students will be responsible for a production report, analyzing their process, successes and challenges. This course will also require students to archive their designs and experiences in a portfolio, which they will present at the end of the spring semester. This course satisfies the Career Technical Education Program requirement and Visual Performing Arts requirement, and may be repeated for three years. Students who enroll in and complete Advanced Stage Technology and Design will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 4,
        "Level": "R",
        "Prerequisites": ["Stage Technology"],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "4915D",
        "Course": "ADVANCED STAGE TECHNOLOGY & DESIGN",
        "Description": "Students will continue to practice their technical theater skills at an advanced level through working in leadership roles on Gunn Theatre Productions. They will manage and supervise a design or construction crew while drawing on their knowledge of theater history, design aesthetics, and creative processes. At the end of a production, students will be responsible for a production report, analyzing their process, successes and challenges. This course will also require students to archive their designs and experiences in a portfolio, which they will present at the end of the spring semester. This course satisfies the Career Technical Education Program requirement and Visual Performing Arts requirement, and may be repeated for three years. Students who enroll in and complete Advanced Stage Technology and Design will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 4,
        "Level": "H",
        "Prerequisites": ["Stage Technology"],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "4507B",
        "Course": "PRINCIPLES OF BUSINESS",
        "Description": "This Blended Learning* course introduces students to the study of Business Management, Economics, Personal Finance, Marketing, and Entrepreneurship. Students complete projects on a range of business topics: economic concepts, financial literacy, investments, sales and marketing strategies, career exploration, and business plan. Students apply what they learn to a variety of real-life examples and scenarios, and share their learning through written work and oral presentations. This course sets the foundation for students seeking success in any career. Students looking to participate in DECA and/or FBLA should take this course to be eligible for competitions.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "2433B",
        "Course": "BUSINESS, ENTREPRENEURSHIP & MATH",
        "Description": "BEAM (Business, Entrepreneurship and Math) is a private-public partnership that replicates real-life business environments, which require application of mathematical principles. During this Blended Learning* course, students develop their own start-ups while learning entrepreneurship, finance, and quantitative marketing from customized curricula created in partnership with Ernst & Young and PricewaterhouseCoopers. The students design and develop self-driven solutions while being mentored by the teacher and designated mentors. After finishing the BEAM curriculum and successfully completing the business pathway, students will have the opportunity to work for local companies or non-profit organizations through internships and/or volunteer consulting work.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "5620",
        "Course": "CULINARY SCIENCE – INTRODUCTION",
        "Description": "If you have a special liking for good food, even if you have never done much more than boil water, this class is for you. If you have had lots of experience in the kitchen but want to stretch your skills, want to explore the why’s and how’s of delicious foods, this is your course, too. An art as well as a science, good cooking rests on basic principles and skills that have been refined over centuries. These principles and skills are demonstrated and practiced in class in clear, easy steps. Plunge in and have fun! Your family and friends will relish the results while you build your reputation as a terrific cook.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "5621",
        "Course": "CULINARY SCIENCE – INTERNATIONAL & REGIONAL",
        "Description": "Join a classroom tour of famous food of the regional United States, Asia, Europe, Africa and more. In addition to selecting, preparing, tasting and enjoying famous dishes typical to each region, you will learn about preparation methods, serving techniques and special equipment specific to the dishes made. If you love to cook and enjoy trying new and different foods, this eighteen-week travelogue of international culinary delights is for you!",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "5622B",
        "Course": "Sports Nutrition",
        "Description": "This Blended Learning* course is all about empowering students with the knowledge to create nutritionally balanced meals that will enhance sports performance as well as overall good health. Guest speakers (Athletes, Sports Trainers, Nutritionists, Former Student Athletes) will be invited into our classroom, and we will use technology to actively engage your mind in the dynamic field of Sports Nutrition. Emphasis is placed on healthy food selection, improving nutritional value through ingredient selection, and cooking techniques that will enable students to create nutritionally balanced delicious dishes. If you are interested in eating for everyday activities or you especially have sports success on your mind; this class will prepare you for a healthy lifestyle with plenty of cooking and you will be creating and analyzing recipes to support peak performance.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "5613",
        "Course": "FIBER ARTS & FASHION DESIGN",
        "Description": "If you like working with fabric and textiles to create unique products, this is the class for you. In this course you will work with many different fibers and material applications. We will cover the fashion design basics - from repairing clothes you already have, to repurposing thrift store finds and learning how to design and construct clothing. Other techniques and skills covered are: quilting, embroidery, machine appliqué, knitting and crocheting. You will also learn to use the sewing and embroidery machines to enhance your creations.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "5851",
        "Course": "INTERIOR DESIGN",
        "Description": "Do you care about your living environment? Do you want your room and your home to reflect you? In this course you will examine your likes and dislikes and to discover and develop your own personal sense of good taste. You will create your own floor plan, select and arrange furniture, fabrics, and accessories for your 'dream home.' You will learn architectural and furniture styles, line, design, form, color and texture and be able to combine them into the kind of living environment which best reflects you. You will also develop an ability to decorate on a budget and how to inexpensively change the appearance of a room.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "5912",
        "Course": "EARLY CHILDHOOD DEVELOPMENT 1",
        "Description": "Students receive classroom instruction working with infant, toddler and preschool children. Students learn basic principles of child growth and development, explore the characteristics of early childhood programs and participate in the implementation of early childhood curriculum. Emphasis is on principles underlying physical, cognitive, emotional and social development, and methods of child study and practical application of theory.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "3955",
        "Course": "BIOTECHNOLOGY: THEORY & PRACTICES",
        "Description": "This course will introduce students to the theoretical aspects of Biotechnology (Cell Biology, Microbiology, Molecular Biology, Immunology) and societal issues arising from this new technology. Hands-on laboratory activities will reinforce theoretical information and teach lab safety, data analysis, the scientific method, and related computer skills. This course may include topical speakers from biotechnology.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": ["Biology", "Chemistry"],
        "Category": ["CTE", "Science"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "4533D",
        "Course": "SPORTS MEDICINE - Dual Enrollment",
        "Description": "Athletic injury prevention is emphasized through pre-participation physical exams, exercise programs, preventative taping, proper fitting of equipment, and protective braces. Basic injury recognition and emergency response of acute trauma. Practical hands-on skills are emphasized in laboratories.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "H",
        "Prerequisites": ["Biology"],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "4540",
        "Course": "CRIMINAL & CIVIL LAW",
        "Description": "This is a very exciting class that will challenge your perspective of law and punishment as we explore controversial cases and issues. Criminal and Civil Law examines the types of crimes, legal rights, as well as the civil consequences faced after a crime. Criminal and Civil Law class also examines torts, individual rights and liberties, contract law and juvenile law. A field trip to criminal court will occur and there will be guest speakers such as lawyers, a police officer, among others.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "4541",
        "Course": "LAW 1",
        "Description": "Law 1 is an exciting legal course targeting students who may consider a career in the legal field. This exciting course takes the students through the criminal justice system, criminal law, Constitutional law, procedural law, adjudication process and an in depth look into landmark court cases. Students also examine the Bill of Rights and how they apply to law. There are many expert guest speakers, such as the FBI, four mock trials, debates, and a field trip to the Ninth Circuit Court of Appeals in this year’s course.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "5043",
        "Course": "AUTOMOTIVE TECHNOLOGY 1",
        "Description": "This course assumes no previous knowledge about automobiles and their operational systems. The course is designed for the owner/driver, and emphasizes the understanding of the operation of automotive components, consumer awareness, preventive maintenance practices, tune-up procedures, elementary trouble analysis, and minor repairs. Approximately 40 percent of the class time is devoted to discussions and demonstrations and 60 percent to related shop activities on shop units and personal automobiles. This is the type of course automobile owners wish they would have taken. Students who enroll in and complete Automotive Technology 1 will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "5050",
        "Course": "AUTOMOTIVE TECHNOLOGY 2",
        "Description": "Designed for the student who desires more information, experience and proficiency related to automotive operation, repair and maintenance. Instrument troubleshooting of electrical systems, brake systems, suspension systems, and custom alignment are but a few of the topics explored in depth in the course. Vehicle design and parts construction/fabrication projects. Certain operations and projects are required but adequate time is provided for personal projects and problems. Competent students who wish to be teacher aides or desire further grooming for employment can make special arrangements for a third year of Auto with the instructor’s permission. They will be classified as teacher aides or special service. Students who enroll in and complete Automotive Technology 2 will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": ["Automotive Technology 1"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "3247",
        "Course": "DIGITAL ELECTRONICS – PLTW",
        "Description": "This course will introduce basic analog and digital electronics concepts to students who want to explore how binary numbers and logic elements are used to implement complex digital circuits. The course is based on curriculum provided by Project Lead the Way (PLTW) and includes topics such as analog circuits, transistors and logic gates, Boolean algebra and Karnaugh mapping, combinational and sequential logic, synchronous and asynchronous clocks, state machines, programmable logic devices and programming microcontrollers. Students use a circuit design program to simulate circuits before building them using soldered breadboards and integrated circuits. Students develop personal engineering notebooks that document skills, design plans and completed projects. Teamwork, problem-solving, and communication skills are developed through group projects. College Board AP + PLTW student recognition: Students who complete two PLTW courses and a STEM (math or science) AP class, with qualifying scores on course-related exams and assessments, earn a College Board AP + PLTW certification of preparation for more advanced course work in college.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Science"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8569",
        "Course": "INTRODUCTION TO ENGINEERING DESIGN – PLTW",
        "Description": "This course will introduce students to basic concepts of design and engineering. The course is based on curriculum provided by Project Lead the Way (PLTW) and has been customized to address Gunn High School’s Silicon Valley student population and equipment, including a state-of-the-art 3D printer. Topics include the process of design, technical sketching, CAD (computer-aided design), dimensional analysis, statistical analysis using Microsoft Excel, tolerances, reverse engineering and 3D printing. Students develop personal engineering notebooks that document skills and designs, including several projects printed on the 3D printer. Teamwork and communication skills are developed through group projects. Students in this course have the opportunity to compete in regional and statewide PLTW design competitions hosted by local tech companies and universities. Students who enroll in and complete Introduction to Engineering Design will be given special consideration during the selection process for the Gunn Robotics Team (GRT).",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Science"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8685",
        "Course": "INTRODUCTION TO ENGINEERING DESIGN HONORS – PLTW",
        "Description": "This course will introduce students to basic concepts of design and engineering. The course is based on curriculum provided by Project Lead the Way (PLTW) and has been customized to address Gunn High School’s Silicon Valley student population and equipment, including a state-of-the-art 3D printer. Topics include the process of design, technical sketching, CAD (computer-aided design), dimensional analysis, data analysis and presentation using spreadsheets, tolerances, reverse engineering and 3D printing. Students develop personal engineering notebooks that document skills and designs, including several projects printed on the 3D printer. Teamwork and communication skills are developed through group projects. Students in this course have the opportunity to compete in regional and statewide PLTW design competitions hosted by local tech companies and universities. Students who enroll in and complete Introduction to Engineering Design will be given special consideration during the selection process for the Gunn Robotics Team (GRT). The honors option requires additional independent study to earn CAD certification. College Board AP + PLTW student recognition: Students who complete two PLTW courses and a STEM (math or science) AP class, with qualifying scores on course-related exams and assessments, earn a College Board AP + PLTW certificate of preparation for more advanced coursework in college.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 0,
        "Level": "H",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Science"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "5090",
        "Course": "PRINCIPLES OF ENGINEERING & ROBOTICS – PLTW",
        "Description": "This course will introduce basic engineering concepts to students who want to build and program their own mechanical inventions. The course is based on curriculum provided by Project Lead the Way (PLTW) and includes topics such as simple machines, energy, statics, electronics, robotic control and real-time programming, and projectile motion. Theory is developed through application problems and hands-on projects built from VEX robotics and other components. Students develop personal engineering notebooks that document skills, design plans and completed projects. Teamwork, problem-solving, and communication skills are developed through group projects. Students in this course also have the opportunity to compete in VEX Robotics competitions. Students who enroll in and complete Principles of Engineering and Robotics will be given special consideration during the selection process for the Gunn Robotics Team (GRT). College Board AP + PLTW student recognition: Students who complete two PLTW courses and a STEM (Math or Science) AP class, with qualifying scores on course-related exams and assessments, earn College Board AP + PLTW student recognition. This recognition shows colleges that you’re prepared for advanced course work in engineering.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "5092",
        "Course": "PRINCIPLES OF ENGINEERING & ROBOTICS HONORS – PLTW",
        "Description": "This course will introduce basic engineering concepts to students who want to build and program their own mechanical inventions. The course is based on curriculum provided by Project Lead the Way (PLTW) and includes topics such as simple machines, energy, statics, electronics, robotic control and real-time programming, and projectile motion. Theory is developed through application problems and hands-on projects built from VEX robotics and other components. Students develop personal engineering notebooks that document skills, design plans and completed projects. Teamwork, problem-solving, and communication skills are developed through group projects. Students in this course also have the opportunity to compete in VEX Robotics competitions. Students who enroll in and complete Principles of Engineering and Robotics will be given special consideration during the selection process for the Gunn Robotics Team (GRT). The honors option requires additional independent on-line study to earn a pre-engineering certification (by passing an online exam administered by the REC Foundation). College Board AP + PLTW student recognition: Students who complete two PLTW courses and a STEM (Math or Science) AP class, with qualifying scores on course-related exams and assessments, earn College Board AP + PLTW student recognition. This recognition shows colleges that you’re prepared for advanced course work in engineering.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "H",
        "Prerequisites": ["Algebra 1A"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8574",
        "Course": "ENGINEERING TECHNOLOGY",
        "Description": "Engineering Technology is a hands-on course that will provide students real-life experience in mechanical design, machine shop skills, engineering project work and leadership. The curriculum is designed to fit the needs of both four-year-college-bound students and those interested in a two-year career tech education. Conceptual instruction begins with the design cycle, which students experience in all stages, including hands-on skill development from brainstorming to prototyping to manufacturing and testing. Mechanism design and prototyping, programming, electronics, pneumatics, machining and welding, and CAD (computer-aided design) technologies are introduced to all students using industry-standard equipment. Applications of scientific and engineering principles, group dynamics, leadership and communication skills are developed in an activity-oriented approach including informal classroom challenges and two or more FIRST Robotics competitions each year. Students who wish to enroll in Engineering Technology must first be selected as members of the Gunn Robotics Team (GRT). A selection process will be used to award spaces within GRT, and detailed information regarding this process will be published in January. Students who have completed Introduction to Engineering Design, Principles of Engineering and Robotics, an Automotive Technology course, or a Stage Technology course will be given special consideration during the selection process.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 12,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "2491B",
        "Course": "AP COMPUTER SCIENCE A",
        "Description": "This Blended Learning* course is designed to give the student a taste of what it is like to be a freshman computer science major at a good university. The course includes data abstraction, procedural abstraction, evaluation processes, top-down design, iteration, recursion, primitive and abstract data types, data structures (arrays, lists, sets, tables, queues, stacks, trees), algorithm analysis and orders of growth, the beginnings of an object system (with message passing), searching and sorting, inheritance and delegation, interfaces and polymorphism, and more! Students should be able to analyze code in terms of functionality, efficiency, readability, reusability, modularity, and meaning.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "AP",
        "Prerequisites": ["Function & Object-Oriented Programming"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8635",
        "Course": "AP COMPUTER SCIENCE PRINCIPLES",
        "Description": "AP Computer Science Principles introduces students to the central ideas of computer science, inviting them to develop the computational thinking vital for success across multiple disciplines. The course encourages students to apply creative processes when developing computational artifacts. Students design and implement innovative solutions using an iterative process similar to what artists, writers, computer scientists, and engineers use to bring ideas to life. They will also develop effective communication and teamwork skills, working individually and collaboratively to solve problems, and discussing and writing about the importance of these problems and the impacts to their community, society, and the world.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "AP",
        "Prerequisites": [],
        "Category": ["CTE", "Science"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8634",
        "Course": "FUNCTIONAL & OBJECT-ORIENTED PROGRAMMING",
        "Description": "This project-based course introduces the student to the functional and object-oriented programming paradigms. It includes concepts such as functions, conditionals, data abstraction, recursion, lambda, higher-order functions, lists, loops, arrays, interfaces, inheritance, and polymorphism. Some projects throughout the year will consist of creating small games, simulating real-world processes, taking apart a computer, and producing graphically interesting programs (such as Conway’s Game of Life) in which almost all of these big ideas are needed.",
        "Grade": [9, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["AP Computer Science Principles"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8638",
        "Course": "COMPUTER SCIENCE CAPSTONE",
        "Description": "This course allows students to apply their computational skills in a real-world context. Students will work in teams to use the design thinking process to identify a problem within their local community and then develop a possible solution. Students will work with mentors related to their problem areas and the teacher of the course will facilitate the design-thinking process and support students in managing their projects. The course will culminate in a public presentation of their yearlong project.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["AP Computer Science A"],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "4735",
        "Course": "WEB DEVELOPMENT",
        "Description": "In this course students will take a project-based approach to learning the basics of full-stack Web development. Topics include how the internet works, http, building databases, version control, servers, the document object model (DOM), Model-View-Controller design pattern, coupled and decoupled applications, routing, API’s, and test-driven development. Languages, modules, libraries, frameworks, etc. are always evolving, but this course will include the following (or an analogue to the following): HTML, CSS, JavaScript, jQuery, Ajax, SQL, Active Record, Ruby, Sinatra, and Ruby on Rails.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": ["Functional & Object-Oriented Programming"],
        "Category": ["CTE"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8484AS",
        "Course": "GENERAL WORK EXPERIENCE",
        "Description": "Work Experience is a program where students can individualize their learning outcomes based on their work-based learning needs: Tier 1 = Work Permit: Students obtain a work permit through the WEEP program, but do not desire to pursue any additional support/guidance at this time. Students do not earn units for this tier. Tier 2 = Work Permit + Certifications: Students obtain a work permit through the WEEP program and can also complete online certifications to gain basic knowledge in certain fields (for example: CPR, Food safety, etc.). Students do not earn units for this tier. Tier 3 = Work Permit + Exploratory or Work Experience Course: Allows students to earn unit credit towards CTE requirements (or elective) and complete relevant certifications to enhance their personalized learning. In addition, students benefit from workplace oversight since the WEEP teacher makes quarterly visits to the student work sites. The WEEP program combines classroom instruction with part-time student employment (internship or paid position). Students develop work habits, attitudes, self-confidence, job-related skills, and demonstrate their mastery through a portfolio. The course follows the California Department of Education guidelines and covers the following curriculum: career exploration, job/work cycle, labor law, economic awareness/financial literacy, and soft skills. Students must have an appropriate* job/internship and obtain a valid work permit prior to attending class. If a student wishes to take the course and does not have a job/internship, the student must meet with the Work Experience Education Teacher to assist with finding a position prior to the beginning of the semester. Class meets one time per week as an 8th period (Gunn Monday after school, Paly Tuesday after school). Students work a minimum of 3 hours per week in addition to their time towards academic work. Students can earn a total of 5 units of credit per semester, but credit earned is variable based on the number of hours worked during the semester and on class attendance. All employers must comply with labor laws and regulations concerning Workers’ Compensation Insurance, Social Security, Title IX, and Income Taxes. An employer-employee relationship must exist and all employers must agree to work with the student and teacher in order for the student to successfully complete the class.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 0,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "8429",
        "Course": "ADVANCED AUTHENTIC RESEARCH (AAR)",
        "Description": "The Advanced Authentic Research (AAR) Program is a unique opportunity for students in grades 10-12, designed for those with interest, passion, curiosity, and perseverance to investigate an authentic topic of their choosing. Students are encouraged to develop a mentorship relationship with an industry expert in their field of inquiry. The student research will be supported by the process-oriented curriculum developed by the AAR Team. Students will spend about 60 hours per semester (about 4 hours per week) on their project both in and out of class. Classes may meet fewer than three times a week, which will require independent learning by students using Web-based tools, along with check-in times with teachers/mentors/attending AAR events. This course can satisfy the Career Technical Education graduation requirement.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 3.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8429AS",
        "Course": "ADVANCED AUTHENTIC RESEARCH (AAR)",
        "Description": "The Advanced Authentic Research (AAR) Program is a unique opportunity for students in grades 10-12, designed for those with interest, passion, curiosity, and perseverance to investigate an authentic topic of their choosing. Students are encouraged to develop a mentorship relationship with an industry expert in their field of inquiry. The student research will be supported by the process-oriented curriculum developed by the AAR Team. Students will spend about 60 hours per semester (about 4 hours per week) on their project both in and out of class. Classes may meet fewer than three times a week, which will require independent learning by students using Web-based tools, along with check-in times with teachers/mentors/attending AAR events. This course can satisfy the Career Technical Education graduation requirement.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 3.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "8429SJ",
        "Course": "ADVANCED AUTHENTIC RESEARCH (AAR)",
        "Description": "The Advanced Authentic Research (AAR) Program is a unique opportunity for students in grades 10-12, designed for those with interest, passion, curiosity, and perseverance to investigate an authentic topic of their choosing. Students are encouraged to develop a mentorship relationship with an industry expert in their field of inquiry. The student research will be supported by the process-oriented curriculum developed by the AAR Team. Students will spend about 60 hours per semester (about 4 hours per week) on their project both in and out of class. Classes may meet fewer than three times a week, which will require independent learning by students using Web-based tools, along with check-in times with teachers/mentors/attending AAR events. This course can satisfy the Career Technical Education graduation requirement.",
        "Grade": [0, 10, 11, 12],
        "HomeworkTime": 3.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["CTE", "Electives"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1180",
        "Course": "FUNDAMENTALS OF COMMUNICATION",
        "Description": "This course is for students who want a college prep program in high school English and is an introduction to basic school-level study of composition, reading, and public speaking. The work of the semester is on effective persuasive organizing, supporting, and presenting materials in a paper or speech. Reading is selected to emphasize the challenges of effective communication. Students should expect to complete two to three major projects, including public speaking, during the course. One semester of this course or of Advanced Communication is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Western Literature"
    },
    {
        "ID": "1181",
        "Course": "ADVANCED COMMUNICATION",
        "Description": "This course is for students who want a college prep program in high school English and is an introduction to basic school-level study of composition, reading, and public speaking. The work of the semester is on effective persuasive organizing, supporting, and presenting materials in a paper or speech. Reading is selected to emphasize the challenges of effective communication. Students should expect to complete two to three major projects, including public speaking, during the course. One semester of this course or of Fundamentals of Communication is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 1.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Western Culture"
    },
    {
        "ID": "2181",
        "Course": "ADVANCED COMMUNICATION SLC",
        "Description": "This course is for students who want a college prep program in high school English and is an introduction to basic school-level study of composition, reading, and public speaking. The work of the semester is on effective persuasive organizing, supporting, and presenting materials in a paper or speech. Reading is selected to emphasize the challenges of effective communication. Students should expect to complete two to three major projects, including public speaking, during the course. One semester of this course or of Fundamentals of Communication is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 1.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Western Culture SLC"
    },
    {
        "ID": "0117",
        "Course": "WESTERN LITERATURE",
        "Description": "This course is for students who want an advanced program in high school English. It uses the works and ideas of classical and 20th century writers such as Shakespeare, Orwell, and Rostand to explore the sources of contemporary trends and thought in literature and composition. Because it is a required course, it includes particular emphasis on instruction in reading and writing. Students should expect to complete two to three major essay-quality assignments during the course. One semester of this course or Western Culture is required.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Fundamentals of Communication"
    },
    {
        "ID": "0118",
        "Course": "WESTERN CULTURE",
        "Description": "This course introduces students in an advanced English program to the writer’s options in literary genres such as drama, memoir, short story, novel, and poetry. Because it is a required course, the works of writers such as Shakespeare, Golding, and Angelou provide the resources for particular emphasis on instruction in reading and literature, writing and composition. One semester of this course or Western Literature is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Advanced Communication"
    },
    {
        "ID": "0218",
        "Course": "WESTERN CULTURE SLC",
        "Description": "This course introduces students in an advanced English program to the writer’s options in literary genres such as drama, memoir, short story, novel, and poetry. Because it is a required course, the works of writers such as Shakespeare, Golding, and Angelou provide the resources for particular emphasis on instruction in reading and literature, writing and composition. One semester of this course or Western Literature is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Advanced Communication SLC"
    },
    {
        "ID": "2108",
        "Course": "WORLD LITERATURE",
        "Description": "This is a course for students who want a college prep program in high school English. It is a general introduction to world literature which includes readings from such authors as Shakespeare, Achebe, Bronte, and Austen. Because it is a required course, it includes particular emphasis on instruction in reading and writing. Students should expect to complete two to three major essay-quality assignments during the course. One semester of this course or World Classics (H) is required.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 2.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "7662",
        "Course": "WORLD CLASSICS H",
        "Description": "This is a course for students who want an advanced program in high school English. This honors-level course uses the works of authors such as Shakespeare, Achebe, Bronte, and Austen to study composition and literature. Additionally, the course utilizes world classics to explore the influence of world culture, thought, and values on contemporary thinking. Because it is a required course, it includes particular emphasis on instruction in reading and writing. Students should expect to complete two to three major essay-quality assignments during the course. One semester of this course or World Literature is required.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 3,
        "Level": "H",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1525B",
        "Course": "ANALYTIC COLLEGE WRITING",
        "Description": "This Blended Learning* course focuses on preparation for college and beyond. Instruction centers on the requisite skills: critical thinking (reading comprehension), vocabulary development, sentence completion techniques, effective timed essay writing, and thorough teaching of grammar in order to prepare students for success in college, from the application process through degree attainment. Fiction and informational text studied and analyzed, in preparation for weekly writings and composition. In addition to grammar, vocabulary, writing, and test preparation, this course also works on the writing and completion of the college essay, research and writing a college search, research and writing a scholarship search, and resume building for jobs and internships, including interview skills and assessment. There is an emphasis on instruction in reading and literature, writing and composition.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1364",
        "Course": "THE WORKS OF SHAKESPEARE",
        "Description": "Afraid of being called a 'beetle - headed, flap - ear’ d knave'? Learn the language to fight back. This course introduces the students to the range of Shakespeare's plays, including comedies, tragedies and histories, and to his sonnets. The course will also introduce students to Shakespeare’s language and times. Students need not be experts in Shakespearean plays to enroll in the course. Experts and novices alike are welcome.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 3,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1384",
        "Course": "ESCAPE LITERATURE",
        "Description": "This course explores three of the most popular forms of modern fiction—mystery, science fiction and horror. From the clever antics of Sherlock Holmes to the dark crevices of Dr. Frankenstein’s lab, students will get a taste for both the groundbreaking works of each form, as well as offerings from modern day writers. We will do both expository and creative writing and a variety of individual and group projects related to the stories and books we read.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1469",
        "Course": "CLASSIC MYTHOLOGY",
        "Description": "The mythology and literature of ancient Greece and Rome is the focus of this multidisciplinary elective for juniors and seniors. The course will touch on the essentials – the gods of Mt. Olympus, the heroes who carried out amazing feats, and the many stories of tragedy, love, humor and adventure. Students will read both ancient and modern versions of the myths and demonstrate their knowledge through a mix of writing, visual arts, performance and research-based activities.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1290",
        "Course": "SHAKESPEARE IN PERFORMANCE",
        "Description": "This interdisciplinary course for juniors and seniors offers students five units of English and five units of Drama credit. Students will enrich their study of a variety of Shakespeare’s plays and sonnets as literary texts with hands-on experiences involving every facet of creating the 'living' play. Students need not have extensive acting experience. Offered in alternate years.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 3,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1332",
        "Course": "FILM AS COMPOSITION IN LITERATURE",
        "Description": "This course relates composition in the motion picture to student reading and writing. It introduces the art and technique of film through a history of the film and a study of its genre and directors. Activities help the student explore film as art and as composition.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "7601",
        "Course": "ANALYSIS OF THE WRITER’S CRAFT",
        "Description": "In this creative writing course, students will have the opportunity to write memoir, short fiction, and poetry, as well as to experiment with innovative forms. We will focus on developing a strong, authentic voice, developing scenes, and understanding effective structure. Students will write daily and will regularly share their work with other students. The course is recommended only for those who understand that the best writing comes from both creativity and discipline.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1179",
        "Course": "PHILOSOPHY THROUGH LITERATURE",
        "Description": "'Too often we enjoy the comfort of opinion without the discomfort of thought' – John F. Kennedy Over the course of the semester, we will explore nearly three thousand years of humanity’s most pressing questions: What is real? Do we have free will? What is the meaning of life? Can we create a just society? In this case we will use a wide range of literature and primary sources ranging from Plato’s Allegory of the Cave to Descartes’ Meditations to Hermann Hesse’s Siddhartha. Students will discuss, debate, and write their own philosophies on life and the world around them.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 2,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1514B",
        "Course": "PHILOSOPHY THROUGH LITERATURE",
        "Description": "'Too often we enjoy the comfort of opinion without the discomfort of thought' – John F. Kennedy Over the course of the semester, we will explore nearly three thousand years of humanity’s most pressing questions: What is real? Do we have free will? What is the meaning of life? Can we create a just society? In this case we will use a wide range of literature and primary sources ranging from Plato’s Allegory of the Cave to Descartes’ Meditations to Hermann Hesse’s Siddhartha. Students will discuss, debate, and write their own philosophies on life and the world around them.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 2,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1279",
        "Course": "AP ENGLISH LITERATURE & COMPOSITION",
        "Description": "This advanced study course is open to seniors who have successfully completed three years of English credit (UC 'b' category). The focus is on college-level work in reading and writing, culminating in preparation for the Advanced Placement Examination in English Literature and Composition. Accepting enrollment in this course indicates a student’s commitment to taking the AP Examination in Literature and Composition in the spring. Students wishing to move from AP English to World Classics 11H or World Literature must do so within the first 4 weeks of first semester.",
        "Grade": [0, 0, 0, 12],
        "HomeworkTime": 3.5,
        "Level": "AP",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1521B",
        "Course": "READING BETWEEN THE LINES",
        "Description": "This Blended Learning course is designed for the college-bound student who wants to strengthen reading, writing and critical thinking skills in preparation for university-level demands. Since the course was designed to mesh with The Expository Reading and Writing Course, the majority of our reading will be non-fiction texts drawn from a variety of disciplines. We also explore contemporary plays about global issues, make space for free reading assignments, and include a creative writing unit in which students convey their learning across the disciplines through narrative. We do most of our reading outside of class, with a focus on developing strategies to help students understand even the most difficult content and text structures. During class meetings we have lively discussions, play-reading time, and instruction in argumentative writing. By the end of the course, students will read more widely, more skillfully, and with more enjoyment than before.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 4,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "7650",
        "Course": "EXPOSITORY READING & WRITING COURSE",
        "Description": "Designed by CSU, the grade 12 Expository Reading and Writing Course (ERWC) is a yearlong course employing a rhetorical, inquiry-based approach that fosters critical thinking, student agency, and metacognition. The course includes five to six full-length modules drawn from three categories: 1) Shakespeare drama; 2) full-length books; and 3) contemporary issues (three to four modules). In addition, the course includes two short portfolio modules and at least three mini-modules that address transferable skills applicable to conceptual development and practice across all modules, e.g., genre awareness, goal setting and self-assessment, rhetorical situation, Aristotelian appeals. The core structure of all the modules – the assignment Template – progresses along an 'arc' from reading rhetorically (preparing to read, reading purposefully, and questioning the text) to preparing to respond (discovering what you think) to writing rhetorically (composing a draft, revising rhetorically, and editing).",
        "Grade": [0, 0, 0, 12],
        "HomeworkTime": 2,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "Y",
        "Autofill": "None"
    },
    {
        "ID": "1522",
        "Course": "THE ART OF VISUAL STORYTELLING",
        "Description": "This course introduces students to a unique genre of literature: the graphic novel. After mastering the basic terms for graphic novel composition, the students will dive into contemporary works and analyze how the combination of art and words impact character development and the structure of the text. We will examine how the graphic novel format can be utilized for sensitive subject matter such as Holocaust survivor narratives. Students will explore the development of superhero stories and discover the impact of other literary genres on superhero texts. Finally, we will delve into manga in order to compare and contrast Eastern and Western styles.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1190",
        "Course": "CONTEMPORARY WRITERS",
        "Description": "This course is for students who want a college prep program in high school English and uses the works and ideas of modern writers such as Harper Lee, Khaled Hosseini, and Julia Alvarez as the focus for studying literature and composition at the high school level. Because it is a required course, it includes particular emphasis on instruction in reading and writing. One semester of this course or Contemporary Heritage is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Writer’s Voice"
    },
    {
        "ID": "1191",
        "Course": "CONTEMPORARY HERITAGE",
        "Description": "This course is for students who want an advanced program in high school English and uses the work of modern writers such as Harper Lee, Khaled Hosseini, Charles Dickens, and Julia Alvarez to explore the sources of contemporary trends and thought in literature and composition. Because this is a required course, it includes particular emphasis on instruction in reading and writing. One semester of this course or Contemporary Writers is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Literary Style"
    },
    {
        "ID": "9409",
        "Course": "CONTEMPORARY HERITAGE SLC",
        "Description": "This course is for students who want an advanced program in high school English and uses the work of modern writers such as Harper Lee, Khaled Hosseini, Charles Dickens, and Julia Alvarez to explore the sources of contemporary trends and thought in literature and composition. Because this is a required course, it includes particular emphasis on instruction in reading and writing. One semester of this course or Contemporary Writers is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Literary Style SLC"
    },
    {
        "ID": "1192",
        "Course": "WRITER’S VOICE",
        "Description": "This college prep course introduces students to the writer’s choices for communicating a message through the variety of literary types: a Shakespearean drama, a memoir, short stories, poetry, and a novel. Because it is a required course, the works provide the resources for particular emphasis on instruction in reading and literature, writing and composition. One semester of this course or Literary Style is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Contemporary Writers"
    },
    {
        "ID": "1193",
        "Course": "LITERARY STYLE",
        "Description": "This course introduces students in an advanced English program to the writer’s options in literary genres such as drama, memoir, short story, novel, and poetry. Because it is a required course, the works of writers such as Shakespeare, Golding, and Angelou provide the resources for particular emphasis on instruction in reading and literature, writing and composition. One semester of this course or Writer’s Voice is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Contemporary Heritage"
    },
    {
        "ID": "9410",
        "Course": "LITERARY STYLE SLC",
        "Description": "This course introduces students in an advanced English program to the writer’s options in literary genres such as drama, memoir, short story, novel, and poetry. Because it is a required course, the works of writers such as Shakespeare, Golding, and Angelou provide the resources for particular emphasis on instruction in reading and literature, writing and composition. One semester of this course or Writer’s Voice is required for graduation.",
        "Grade": [9, 10, 0, 0],
        "HomeworkTime": 2.5,
        "Level": "A",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "Contemporary Heritage SLC"
    },
    {
        "ID": "1263",
        "Course": "AMERICAN LITERATURE",
        "Description": "This college prep course for students uses the works of important American writers such as Fitzgerald, Steinbeck, Morrison, and Tan as the focus for studying composition and literature as well as American thought and values. Because it is a required course, it includes a particular emphasis on instruction in reading and writing. One semester of this course or American Classics H is required for graduation.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1309",
        "Course": "AMERICAN CLASSICS H",
        "Description": "This advanced course for students uses the works of major American writers such as Fitzgerald, Steinbeck, Morrison, and Tan as the source of studying composition and literature as well as American thought, culture, and values. As a required course, it includes a particular emphasis on instruction in reading and writing. One semester of this course or American Literature is required for graduation.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 2.5,
        "Level": "H",
        "Prerequisites": [],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    },
    {
        "ID": "1203",
        "Course": "DRAMATIC LITERATURE IN PERFORMANCE",
        "Description": "This interdisciplinary course for juniors and seniors offers students five units of English and five units of Drama credit. Students will enrich their study of a variety of plays as literary texts with hands-on experiences involving every facet of creating the 'living' play. Students need not have extensive acting experience. Offered in alternate years.",
        "Grade": [0, 0, 11, 12],
        "HomeworkTime": 1.5,
        "Level": "R",
        "Prerequisites": ["Theatre 2"],
        "Category": ["English"],
        "Length": "S",
        "Autofill": "None"
    }
]